#include <iostream>
#include"ULIST.h"
#include"UList.cpp"
using namespace std;

int main()
{
    setlocale(LC_ALL, "Russian");
    ulist<int, std::string> lisT;
    cout << "############################################################################" << endl;
    cout << "#                                                                          #" << endl;
    cout << "#                        ##   ##  ####  #  #  #   ##                       #" << endl;
    cout << "#                        # # # #  #     #  #  #  #  #                      #" << endl;
    cout << "#                        #  #  #  ####  ####  ####  #                      #" << endl;
    cout << "#                        #     #  #     #  #  #  #  #                      #" << endl;
    cout << "#                        #     #  ####  #  #  #   ##                       #" << endl;
    cout << "#                                                                          #" << endl;
    cout << "############################################################################" << endl;
    cout << "#                                                                          #" << endl;
    cout << "#                                                                          #" << endl;
    cout << "#                 ÂÛÁÅÐÈÒÅ ÈÇ ÏÐÅÄËÎÆÅÍÍÛÕ ÍÈÆÅ ÂÀÐÈÀÍÒÎÂ                  #" << endl;
    cout << "#                                                                          #" << endl;
    cout << "#     0) ÇÀÊÎÍ×ÈÒÜ ÐÀÁÎÒÓ ÏÐÎÃÐÀÌÌÛ                                        #" << endl;
    cout << "#     1) ÄÎÁÀÂÈÒÜ ÃÐÓÇ ÍÀ ÑÊËÀÄ                                            #" << endl;
    cout << "#     2) ÓÇÍÀÒÜ ÊÎËÈ×ÅÑÒÂÎ ÒÎÂÀÐÎÂ ÍÀ ÑÊËÀÄÅ                               #" << endl;
    cout << "#     3) ÏÎÊÀÇÀÒÜ ÈÍÔÎÐÌÀÖÈÞ Î ÒÎÂÀÐÀÕ ÍÀ ÑÊËÀÄÅ                           #" << endl;
    cout << "#     4) ÈÇÌÅÍÈÒÜ ÕÀÐÊÒÅÐÈÑÒÈÊÈ ÒÎÂÐÀ                                      #" << endl;
    cout << "#     5) ÂÛÂÅÑÒÈ ÈÑÒÎÐÈÞ ÎÏÅÐÀÖÈÉ ÍÀ ÝÊÐÀÍ                                 #" << endl;
    cout << "#     6) Î×ÈÑÒÈÒÜ ÈÑÒÎÐÈÞ ÎÏÅÐÀÖÈÉ                                         #" << endl;
    cout << "#     7) ÓÄÀËÈÒÜ ÃÐÓÇ ÑÎ ÑÊËÀÄÀ                                            #" << endl;
    cout << "#     8) ÏÎÑÌÎÒÐÅÒÜ ÈÍÔÎÐÌÀÖÈÞ Î ÒÎÂÀÐÅ ÏÎ ÅÃÎ ÍÀÇÂÀÍÈÞ                    #" << endl;
    cout << "#     9) ÏÎÑÌÎÒÐÅÒÜ ÎÑÒÀÒÎÊ ÒÎÂÀÐÎÂ ÍÀ ÑÊËÀÄÅ ÏÎ ÄÀÒÅ                      #" << endl;
    cout << "#     10) ÎÒÑÎÐÒÈÐÎÂÀÒÜ ÒÎÂÀÐ ÍÀ ÑÊËÀÄÅ ÏÎ ÅÃÎ ÊÎËÈ×ÅÑÒÂÓ                  #" << endl;
    cout << "#                                                                          #" << endl;
    cout << "############################################################################" << endl;
    int q = -1;
    while (q != 0)
    {
        cout << "#    ÂÀØ ÂÛÁÎÐ:                                                            #" << endl;
        cout << "#                                                                          #" << endl;
        cin >> q;

        switch (q)
        {
        case 0:
            return 0;
            break;
        case 1:
            cout << "#     ÂÂÅÄÈÒÅ ÕÀÐÀÊÒÅÐÈÑÒÈÊÈ ÒÎÂÀÐÀ, À ÈÌÅÍÍÎ:                             #" << endl;
            cout << "#     ÌÀÑÑÀ ÃÐÓÇÀ, ÊÎËÈ×ÅÑÒÂÎ, ÍÀÇÂÀÍÈÅ, ÄÀÒÀ ÏÎÑÒÀÂÊÈ                     #" << endl;
            cout << "#     È ÑÒÐÀÍÓ ÏÐÎÈÇÂÎÄÈÒÅËß.                                              # " << endl;
            lisT.AddToHead();
            cout << "#     ÒÎÂÀÐ ÓÑÏÅØÍÎ ÄÎÁÀÂËÅÍ ÍÀ ÑÊËÀÄ!                                     # " << endl;
            break;
        case 2:
            lisT.SizePro();
            break;
        case 3:
            lisT.ShowL();
            break;
        case 4:
            int z;
            cout << "#     Âûáåðèòå õîðàêòåðèñòèêó, ïî êîòîðîé õîòèòå îñóùêñòâèòü âûáîð:        #" << endl;
            cout << "#     0. Çàâåðøèòü ðàáîòó. 1. Ñòðàíà. 2. Íàçâàíèå 3.Âåðíóòüñÿ ìåíþ:        #" << endl;
            cin >> z;
            if (z == 1)
            {
                cout << "#      ÂÂÅÄÈÒÅ ÕÀÐÀÊÒÅÐÈÑÒÈÊÓ, À ÏÎÑËÅ:                                    #" << endl;
                cout << "#     ÂÂÅÄÈÒÅ ÕÀÐÀÊÒÅÐÈÑÒÈÊÈ ÒÎÂÀÐÀ, À ÈÌÅÍÍÎ:                             #" << endl;
                cout << "#     ÌÀÑÑÀ ÃÐÓÇÀ, ÊÎËÈ×ÅÑÒÂÎ, ÄÀÒÀ ÏÎÑÒÀÂÊÈ, ÍÀÇÂÀÍÈÅ                     #" << endl;
                lisT.changeCountry();
            }
            else if (z == 2)
            {
                cout << "#      ÂÂÅÄÈÒÅ ÕÀÐÀÊÒÅÐÈÑÒÈÊÓ, À ÏÎÑËÅ:                                    #" << endl;
                cout << "#     ÂÂÅÄÈÒÅ ÕÀÐÀÊÒÅÐÈÑÒÈÊÈ ÒÎÂÀÐÀ, À ÈÌÅÍÍÎ:                             #" << endl;
                cout << "#     ÌÀÑÑÀ ÃÐÓÇÀ, ÊÎËÈ×ÅÑÒÂÎ, ÄÀÒÀ ÏÎÑÒÀÂÊÈ, ÑÒÐÀÍÀ                       #" << endl;
                lisT.changeName();
            }
            else if (z == 0)
            {
                return 0;
            }
            else if (z == 3)
            {
                cout << "#    Íàæìèòå ëþáóþ öèôðó, ÷òîáû ïðîäîëæèòü:                                #" << endl;
                cout << "#                                                                          #" << endl;
                cin >> q;
            }
            break;
        case 5:
            lisT.read();
            break;
        case 6:
            lisT.rewrite();
            cout << "Èñòîðèÿ îïåðàöèé óñïåøíî óäàëåíà!";
            break;
        case 7:
            int q;
            cout << "Âûáåðèòå õîðàêòåðèñòèêó, ïî êîòîðîé õîòèòå îñóùåcòâèòü óäàëåíèå:" << endl;
            cout << "0. Çàâåðøèòü ðàáîòó. 1. Ñòðàíà. 2. Íàçâàíèå 3.Äàòà 4. Âåðíóòüñÿ â ãëàâíîå ìåíþ: " << endl;
            cin >> q;
            if (q == 1)
            {
                cout << "ÂÂÅÄÈÒÅ ÍÀÇÂÀÍÈÅ ÑÒÐÀÍÛ:" << endl;
                lisT.delCountry();
                cout << "Ãîòîâî!" << endl;
            }
            else if (q == 2)
            {
                cout << "ÂÂÅÄÈÒÅ ÍÀÇÂÀÍÈÅ ÒÎÂÀÐÀ:" << endl;
                lisT.delName();
                cout << "Ãîòîâî!" << endl;
            }
            else if (q == 0)
            {
                return 0;
            }
            else if (q == 3)
            {
                cout << "ÂÂÅÄÈÒÅ ÄÀÒÓ:" << endl;
                lisT.delDate();
                cout << "Ãîòîâî!" << endl;
            }
            else if (q == 4)
            {
                cout << "#    Íàæìèòå ëþáóþ öèôðó, ò÷îáû ïðîäîëæèòü :                               #" << endl;
                cout << "#                                                                          #" << endl;
                cin >> q;
            }
            break;
        case 8:
            cout << "ÂÂÅÄÈÒÅ ÍÀÇÂÀÍÈÅ ÒÎÂÀÐÀ, Î ÊÎÒÎÐÎÌ ÕÎÒÈÒÅ ÓÇÍÀÒÜ ÈÍÔÎÐÌÀÖÈÞ: " << endl;
            lisT.printelement();
            break;
        case 9:
            cout << "ÂÂÅÄÈÒÅ ÄÀÒÓ, ÍÀ ÊÎÒÎÐÓÞ ÕÎÒÈÒÅ ÓÇÍÀÒÜ ÎÑÒÀÒÎÊ ÒÎÂÀÐÀ " << endl;
            lisT.findDate();
            break;
        case 10:
            lisT.Lsort();
            cout << "ÒÎÂÀÐ ÓÑÏÅØÍÎ ÎÒÑÎÐÒÈÐÎÂÀÍ!" << endl;
            break;
        }
    }
    return 0;
}



